src/cf/Documents/ФормированиеЗаписейКнигиПродаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ФормированиеЗаписейКнигиПродаж</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.НДСЗаписиКнигиПродаж</xr:Item>
				<xr:Item>AccumulationRegister.НДСАвансыВыданные</xr:Item>
				<xr:Item>AccumulationRegister.НДСРеализация0</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьСторнирующиеЗаписиДопЛистовВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Реализация0</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументСозданВПомощнике</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВосстановленПоАвансам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетФактура</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
								<v8:Type>cfg:DocumentRef.СчетФактураПолученный</v8:Type>
								<v8:Type>cfg:DocumentRef.РасходСоСчета</v8:Type>
								<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
								<v8:Type>cfg:DocumentRef.КорректировкаПоступления</v8:Type>
								<v8:Type>cfg:DocumentRef.РасходИзКассы</v8:Type>
								<v8:Type>cfg:DocumentRef.ОперацияПоПлатежнымКартам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБезНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаписьДополнительногоЛиста</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КорректируемыйПериод</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СторнирующаяЗаписьДопЛиста</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсправленныйСчетФактура</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СчетФактураПолученный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/ДанныеПервичныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДанныеПервичныхДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистратора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерРегистратора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоУниверсальныйДокумент</Name>
					<Comment>УПД, УКД</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоКорректировочныйДокумент</Name>
					<Comment>УКД</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ФормированиеЗаписейКнигиПокупок</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходнаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураПолученный</v8:Type>
						<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
						<v8:Type>cfg:DocumentRef.АктВыполненныхРабот</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходСоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОПереработке</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактура</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеВКассу</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаПоступления</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриемИПередачаВРемонт</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ПодтверждениеНулевойСтавкиНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявлениеОВвозеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетПереработчика</v8:Type>
						<v8:Type>cfg:DocumentRef.ФормированиеЗаписейРаздела7ДекларацииНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПодтверждениеОплатыНДСВБюджет</v8:Type>
						<v8:Type>cfg:DocumentRef.ФормированиеЗаписейКнигиПродаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитенту</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходИзКассы</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтражениеНДСКВычету</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходыПриИмпорте</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаСчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ДополнительныеРасходы</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацияПоПлатежнымКартам</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаТоваровМеждуОрганизациями</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/AccumulationRegisters/НДСАвансыВыданные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>НДСАвансыВыданные</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаБезНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДСУпр</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СобытияНДСАвансы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументЗачетаАванса</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КорректировкаПоступления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентнаяОперация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОплаты</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходСоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаПоступления</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходИзКассы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсправленныйСчетФактура</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетФактураПолученный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/Enums/ВидыАгентскихДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыАгентскихДоговоров</Name>
			<Comment>Виды договоров, согласно которым организация выступает в качестве налогового агента</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Аренда</Name>
					<Comment>Договор аренды муниципального имущества</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеализацияИмущества</Name>
					<Comment>Договор покупки государственного или муниципального имущества</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нерезидент</Name>
					<Comment>Договор с контрагентом (иностранной компанией) не являющимся плательщиком НДС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НерезидентЭлектронныеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеализацияТоваров</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/СобытияПоНДСПродажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СобытияПоНДСПродажи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПолученАванс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реализация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДСНачисленКУплате</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтвержденаСтавка0</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПодтвержденаСтавка0</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДССкорректирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВосстановлениеНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогИсчисляетПокупатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВосстановлениеНДС0</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыОперацийСчетФактураПолученный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийСчетФактураПолученный</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаАвансКомитента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поступление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аванс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СуммовыеРазницы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Корректировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаАванса</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ТипыРасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыРасчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Долг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аванс</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/ФормированиеЗаписейКнигиПродаж/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВремяДокументаПоУмолчанию() Экспорт
	
	Возврат Новый Структура("Часы, Минуты", 23, 0);
	
КонецФункции

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

Функция РеквизитыНеРедактируемыеВГрупповойОбработке() Экспорт
	
	МассивРеквизитов = Новый Массив();
	МассивРеквизитов.Добавить("ДокументСозданВПомощнике");
	
	Возврат МассивРеквизитов;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПодготовкаПараметровПроведения

Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт
	
	ПараметрыПроведения = Новый Структура;
	НомераТаблиц = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Запрос.Текст = ТекстЗапросаРеквизитыДокумента();
    Результат = Запрос.Выполнить();
    
    ПараметрыПроведения.Вставить("Реквизиты", Результат.Выгрузить());
	
	Реквизиты = ПараметрыПроведения.Реквизиты[0];
	
	Если НЕ УчетнаяПолитика.Существует(Реквизиты.Организация, Реквизиты.Период) Тогда
		Отказ = Истина;
		Возврат ПараметрыПроведения;
	КонецЕсли;
	
	Реквизиты.УпрощенныйУчетНДС = Ложь;
	
	Запрос.УстановитьПараметр("Организация", Реквизиты.Организация);
	Запрос.УстановитьПараметр("Реализация0", Реквизиты.Реализация0);
	
	Запрос.Текст = 
		ТекстЗапросаВосстановленПоАвансам(НомераТаблиц);
		
	Результат = Запрос.ВыполнитьПакет();
	
	Для каждого НомерТаблицы Из НомераТаблиц Цикл
		ПараметрыПроведения.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла;

	Возврат ПараметрыПроведения;
	
КонецФункции

Функция ТекстЗапросаРеквизитыДокумента()

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Реквизиты.Дата КАК Период,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.Ссылка КАК Регистратор,
	|	НЕОПРЕДЕЛЕНО КАК УпрощенныйУчетНДС,
	|	Реквизиты.ФормироватьСторнирующиеЗаписиДопЛистовВручную КАК ФормироватьСторнирующиеЗаписиДопЛистовВручную,
	|	Реквизиты.Реализация0
	|ИЗ
	|	Документ.ФормированиеЗаписейКнигиПродаж КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВосстановленПоАвансам(НомераТаблиц)
    
    НомераТаблиц.Вставить("ТаблицаВосстановленПоАвансам", НомераТаблиц.Количество());
    
    ТекстЗапроса = 
    "ВЫБРАТЬ
    |    ТаблицаВосстановленПоАвансам.Ссылка КАК Регистратор,
    |    ТаблицаВосстановленПоАвансам.Ссылка.Дата КАК Период,
    |    ТаблицаВосстановленПоАвансам.Ссылка.Организация КАК Организация,
    |    ТаблицаВосстановленПоАвансам.Поставщик КАК Покупатель,
    |    ТаблицаВосстановленПоАвансам.ДоговорКонтрагента КАК ДоговорКонтрагента,
    |    ТаблицаВосстановленПоАвансам.СчетФактура КАК СчетФактура,
    |    ДанныеПервичныхДокументовСчетФактура.ДатаРегистратора КАК ДатаСчетаФактуры,
    |    ТаблицаВосстановленПоАвансам.СтавкаНДС КАК СтавкаНДС,
    |    ТаблицаВосстановленПоАвансам.СуммаБезНДС КАК СуммаБезНДС,
    |    ТаблицаВосстановленПоАвансам.НДС КАК НДС,
    |    ТаблицаВосстановленПоАвансам.ЗаписьДополнительногоЛиста КАК ЗаписьДополнительногоЛиста,
    |    ТаблицаВосстановленПоАвансам.СторнирующаяЗаписьДопЛиста КАК СторнирующаяЗаписьДопЛиста,
    |    ВЫБОР
    |        КОГДА НЕ ТаблицаВосстановленПоАвансам.ЗаписьДополнительногоЛиста
    |            ТОГДА ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
    |        ИНАЧЕ ТаблицаВосстановленПоАвансам.КорректируемыйПериод
    |    КОНЕЦ КАК КорректируемыйПериод,
    |    ВЫБОР
    |        КОГДА ДанныеПервичныхДокументовСчетФактура.ДатаРегистратора < ДАТАВРЕМЯ(2018, 1, 1)
    |        ИЛИ ЕСТЬNULL(ДоговорыКонтрагентов.Ссылка,
    |            ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
    |            ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.АвансыВыданные)
    |        КОГДА ДоговорыКонтрагентов.УчетАгентскогоНДС
    |        И ДоговорыКонтрагентов.ВидАгентскогоДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыАгентскихДоговоров.РеализацияТоваров)
    |            ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.АвансыВыданныеНалоговыйАгент)
    |        ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.АвансыВыданные)
    |    КОНЕЦ КАК ВидЦенности,
    |    ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПродажи.ВосстановлениеНДС) КАК Событие,
    |    ТаблицаВосстановленПоАвансам.СчетФактура КАК ДокументОплаты,
    |    ДанныеПервичныхДокументовСчетФактура.ДатаРегистратора КАК ДатаОплаты,
    |    ТаблицаВосстановленПоАвансам.Ссылка.Дата КАК ДатаСобытия,
    |    ТаблицаВосстановленПоАвансам.ИсправленныйСчетФактура КАК ИсправленныйСчетФактура,
    |    ВЫБОР
    |        КОГДА ТаблицаВосстановленПоАвансам.Ссылка.Дата < ДАТАВРЕМЯ(2015, 1, 1)
    |            ТОГДА """"
    |        ИНАЧЕ ""21""
    |    КОНЕЦ КАК КодВидаОперации
    |ИЗ
    |    Документ.ФормированиеЗаписейКнигиПродаж.ВосстановленПоАвансам КАК ТаблицаВосстановленПоАвансам
    |        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументовСчетФактура
    |        ПО ТаблицаВосстановленПоАвансам.СчетФактура = ДанныеПервичныхДокументовСчетФактура.Документ
    |        И ДанныеПервичныхДокументовСчетФактура.Организация = &Организация
    |        ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
    |        ПО ТаблицаВосстановленПоАвансам.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
    |ГДЕ
    |    ТаблицаВосстановленПоАвансам.Ссылка = &Ссылка
    |
    |УПОРЯДОЧИТЬ ПО
    |    ТаблицаВосстановленПоАвансам.НомерСтроки";

    Возврат ТекстЗапроса + ОбщегоНазначенияУНФКлиентСервер.ТекстРазделителяЗапросовПакета();
    
КонецФункции

#КонецОбласти

#Область ЗаполнениеДокумента

Процедура ПодготовитьДанныеДляЗаполнения(СтруктураПараметров, АдресХранилища) Экспорт
	
	ДанныеДляЗаполнения = Новый Структура;
	
	ИмяТабЧасти = СтруктураПараметров.ИмяТабЧасти;
	
	Если ИмяТабЧасти = Неопределено Тогда 
		Если УчетНДСКлиентСервер.Версия(СтруктураПараметров.Дата) = 2 Тогда
			ДанныеДляЗаполнения.Вставить(
				"ВосстановленПоАвансам", ПодготовитьДанныеРазделаВосстановленПоАвансам(СтруктураПараметров));
		КонецЕсли;
		
	ИначеЕсли ИмяТабЧасти = "ВосстановленПоАвансам" Тогда
		ДанныеДляЗаполнения.Вставить(
			"ВосстановленПоАвансам", ПодготовитьДанныеРазделаВосстановленПоАвансам(СтруктураПараметров));
			
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(ДанныеДляЗаполнения, АдресХранилища);
	
КонецПроцедуры

// Заполнение ТЧ ВосстановленПоАвансам
Функция ПодготовитьДанныеРазделаВосстановленПоАвансам(СтруктураПараметров) Экспорт

//	Если УчетнаяПолитика.УпрощенныйУчетНДС(СтруктураПараметров.Организация, СтруктураПараметров.Дата) 
//		ИЛИ УчетНДСКлиентСервер.Версия(СтруктураПараметров.Дата) = 2 Тогда
		ТаблицаВосстановленПоАвансам = ПолучитьТаблицуВосстановленПоАвансамУпрощенныйУчетНДС(СтруктураПараметров);
//	Иначе
//		ТаблицаВосстановленПоАвансам = ПолучитьТаблицуВосстановленПоАвансам(СтруктураПараметров);
//	КонецЕсли;
	
	Возврат ТаблицаВосстановленПоАвансам;
	
КонецФункции

Функция ПолучитьТаблицуВосстановленПоАвансамУпрощенныйУчетНДС(СтруктураПараметров)

//	ВидыСубконто = Новый Массив;
//	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
//	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СФПолученные);
//	
//	МассивСчетовАвансов = Новый Массив();
//	МассивСчетовАвансов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоАвансамВыданным); // 60.02
//	МассивСчетовАвансов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоАвансамВыданнымВал); // 60.22
//	МассивСчетовАвансов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоАвансамВыданнымУЕ); // 60.32
//	
//	СубконтоСчетаРасчетов_ЕстьДР = Новый Массив();
//	СубконтоСчетаРасчетов_ЕстьДР.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
//	СубконтоСчетаРасчетов_ЕстьДР.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
//	СубконтоСчетаРасчетов_ЕстьДР.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами);
//	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",         СтруктураПараметров.Организация);
	Запрос.УстановитьПараметр("ДатаГраница",         Новый Граница(КонецДня(СтруктураПараметров.Дата), ВидГраницы.Включая));
	
	// Движения по курсовым разницам не должны вызывать регистрации аванса
//	Запрос.УстановитьПараметр("МассивСчетовАвансов",          МассивСчетовАвансов);
//	Запрос.УстановитьПараметр("ВидыСубконто",                 ВидыСубконто);
//	Запрос.УстановитьПараметр("СубконтоСчетаРасчетов_ЕстьДР", СубконтоСчетаРасчетов_ЕстьДР);
	
	// Подготавливаем исходные данные.
	Запрос.Текст = ПолучитьТекстЗапросаВосстановленПоАвансамУпрощенныйУчетНДС();
	
	УстановитьПривилегированныйРежим(Истина);
	Результаты = Запрос.ВыполнитьПакет();
	
	ОстаткиПоРегистру = Результаты[5].Выгрузить();
	КоличествоСтрокОстаткаПоРегистру = ОстаткиПоРегистру.Количество();
	Если КоличествоСтрокОстаткаПоРегистру = 0 Тогда
		Возврат ОстаткиПоРегистру;
	КонецЕсли;
	
	ОстаткиПоСчету = Результаты[6].Выгрузить();
	
	// Параллельно обходим две таблицы, одинаково отсортированые.
	ИндексСтрокиОстаткаПоРегистру = 0;
	Для каждого СтрокаОстаткаПоСчету Из ОстаткиПоСчету Цикл
		
		// Проходим остатки по регистру, которые соответствуют остаткам по счету.
	    Пока ИндексСтрокиОстаткаПоРегистру < КоличествоСтрокОстаткаПоРегистру Цикл
	    
	    	СтрокаОстаткаПоРегистру = ОстаткиПоРегистру[ИндексСтрокиОстаткаПоРегистру];
			Если СтрокаОстаткаПоРегистру.СчетФактура <> СтрокаОстаткаПоСчету.СчетФактура
			 Или СтрокаОстаткаПоРегистру.Поставщик <> СтрокаОстаткаПоСчету.Поставщик Тогда
				Прервать; // данные, соответствующие другому остатку по счету
			КонецЕсли;
	
	        Если СтрокаОстаткаПоСчету.СуммаНДСАванса = 0 Тогда
		    	// не должно быть остатков по регистру, если нет остатков по счету
		    	ОстаткиПоРегистру.Удалить(ИндексСтрокиОстаткаПоРегистру);
		    	КоличествоСтрокОстаткаПоРегистру = КоличествоСтрокОстаткаПоРегистру - 1;
		    	
		    Иначе
				
		    	Если СтрокаОстаткаПоСчету.СуммаНДСАванса >= СтрокаОстаткаПоРегистру.НДС Тогда
					СтрокаОстаткаПоСчету.СуммаНДСАванса = СтрокаОстаткаПоСчету.СуммаНДСАванса - СтрокаОстаткаПоРегистру.НДС;
				Иначе				
					СтрокаОстаткаПоРегистру.СуммаБезНДС = Окр(СтрокаОстаткаПоРегистру.СуммаБезНДС
						- (СтрокаОстаткаПоРегистру.СуммаБезНДС / СтрокаОстаткаПоРегистру.НДС) * СтрокаОстаткаПоСчету.СуммаНДСАванса, 2);
					СтрокаОстаткаПоРегистру.НДС = СтрокаОстаткаПоРегистру.НДС - СтрокаОстаткаПоСчету.СуммаНДСАванса;
				КонецЕсли;
				ИндексСтрокиОстаткаПоРегистру = ИндексСтрокиОстаткаПоРегистру + 1;
		    
			КонецЕсли; 
	    
	    КонецЦикла;
	    
	КонецЦикла;
	
	Если КоличествоСтрокОстаткаПоРегистру = 0 Тогда
		Возврат ОстаткиПоРегистру;
	КонецЕсли;
	
	СравнениеПоИдентификатору = Новый СравнениеЗначений;
	ОстаткиПоРегистру.Сортировать("Поставщик, СчетФактура, ДоговорКонтрагента", СравнениеПоИдентификатору);
	НепогашенныеАвансы = Результаты[7].Выбрать(); // отсортированы как ОстаткиПоРегистру
	
	// Параллельно обходим две таблицы, одинаково отсортированые.
	СтруктураОтбора = СтруктураОтбораСтрок();
	МассивСуммаБезНДС = Новый Массив;
	МассивСуммаНДС    = Новый Массив;
	ИндексСтрокиОстаткаПоРегистру = 0;
	Пока НепогашенныеАвансы.Следующий() Цикл
	
		СуммаБезНДС = 0;
		МассивСуммаБезНДС.Очистить();
		СуммаНДС = 0;
		МассивСуммаНДС.Очистить();
		СтавкаНДС = Перечисления.СтавкиНДС.ПустаяСсылка();
		
		СуммаНепогашенногоАванса = НепогашенныеАвансы.Сумма;
		
		Если СтруктураОтбора.СчетФактура <> НепогашенныеАвансы.СчетФактура
			ИЛИ СтруктураОтбора.Поставщик <> НепогашенныеАвансы.Поставщик 
			ИЛИ СтруктураОтбора.ДоговорКонтрагента <> НепогашенныеАвансы.ДоговорКонтрагента Тогда
			// Повторный поиск (например, если разные ДатаСобытия) не выполняем. Используем ранее полученные строки.
			
			СтруктураОтбора.Поставщик          = НепогашенныеАвансы.Поставщик;
			СтруктураОтбора.ДоговорКонтрагента = НепогашенныеАвансы.ДоговорКонтрагента;
			СтруктураОтбора.СчетФактура        = НепогашенныеАвансы.СчетФактура;
			СтрокиАвансаПоОтбору = УчетНДСПереопределяемый.НайтиСтрокиПоОтбору(
				ОстаткиПоРегистру, ИндексСтрокиОстаткаПоРегистру, СтруктураОтбора, "Поставщик", СравнениеПоИдентификатору);
				
		КонецЕсли;
	
		Для каждого СтрокаАвансаПоОтбору Из СтрокиАвансаПоОтбору Цикл
			МассивСуммаБезНДС.Добавить(СтрокаАвансаПоОтбору.СуммаБезНДС);
			МассивСуммаНДС.Добавить(СтрокаАвансаПоОтбору.НДС);
			
			СуммаБезНДС = СуммаБезНДС + СтрокаАвансаПоОтбору.СуммаБезНДС;
			СуммаНДС    = СуммаНДС + СтрокаАвансаПоОтбору.НДС;
			
			Если СтрокаАвансаПоОтбору.ВидЦенности = Перечисления.ВидыЦенностей.АвансыВыданныеНалоговыйАгент Тогда
				СтавкаНДС = СтрокаАвансаПоОтбору.СтавкаНДС;
			КонецЕсли;
			
		КонецЦикла;
		
		Если СтавкаНДС <> Перечисления.СтавкиНДС.ПустаяСсылка() Тогда
			// Поставщик товаров, указанных в п.8 ст. 161 НК, не предъявляет НДС.
			// Соответственно сумма остатка аванса на счете 60.х2 не включает НДС.
			// Для правильного определения суммы без НДС и НДС необходимо увеличить сумму непогашенного аванса на сумму НДС.
			СтавкаНДСЧисло = УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(СтавкаНДС);
			СуммаНепогашенногоАванса = СуммаНепогашенногоАванса + СуммаНепогашенногоАванса * СтавкаНДСЧисло / 100;
		КонецЕсли; 
		
		СуммаСНДС = Мин(СуммаНепогашенногоАванса, СуммаБезНДС + СуммаНДС);
		Если СуммаСНДС = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СуммаБезНДС = Окр(СуммаБезНДС * СуммаСНДС / (СуммаБезНДС + СуммаНДС), 2);
		Если СуммаБезНДС > 0 Тогда
			МассивСуммаБезНДС = ОбщегоНазначенияУНФКлиентСервер.РаспределитьПропорционально(СуммаБезНДС, МассивСуммаБезНДС);
		КонецЕсли;
		
		СуммаНДС = СуммаСНДС - СуммаБезНДС;
		Если СуммаНДС > 0 Тогда
			МассивСуммаНДС = ОбщегоНазначенияУНФКлиентСервер.РаспределитьПропорционально(СуммаНДС, МассивСуммаНДС);
		КонецЕсли;
		
		Если МассивСуммаБезНДС = Неопределено
		 Или МассивСуммаНДС = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Счетчик = 0;
		Для каждого СтрокаАвансаПоОтбору Из СтрокиАвансаПоОтбору Цикл
			СтрокаАвансаПоОтбору.СуммаБезНДС = СтрокаАвансаПоОтбору.СуммаБезНДС - ?(СуммаБезНДС > 0, МассивСуммаБезНДС[Счетчик], 0);
			СтрокаАвансаПоОтбору.НДС = СтрокаАвансаПоОтбору.НДС - ?(СуммаНДС > 0, МассивСуммаНДС[Счетчик], 0);
			Счетчик = Счетчик + 1;
		КонецЦикла;
		
	КонецЦикла;
	
	СтрокиКУдалению = ОстаткиПоРегистру.НайтиСтроки(Новый Структура("СуммаБезНДС, НДС", 0, 0));
	Для каждого СтрокаКУдалению Из СтрокиКУдалению Цикл
		ОстаткиПоРегистру.Удалить(СтрокаКУдалению);
	КонецЦикла; 
	
	Возврат ОстаткиПоРегистру;
		
КонецФункции

Функция ПолучитьТекстЗапросаВосстановленПоАвансамУпрощенныйУчетНДС()

    // 0. Остатки по БУ.
    // 1. Исключаем полученные счета-фактуры на аванс по договорам вида "С комиссионером на закупку", составленные от имени поставщиков.
    //    Восстановление НДС по таким счетам-фактурам производится вручную на основании информации, полученной от комиссионера.
    // 2. Договоры счетов-фактур по документу аванса.
    // 3-5. Получаем обороты из регистра накопления НДСЗаписиКнигиПокупок за вычетом НДСЗаписиКнигиПродаж.
    // 6. Получаем остатки по БУ.
    // 7. Список счетов, имеющих субконто ДокументыРасчетовСКонтрагентами.
    // 8. Получим остатки по авансам для определения суммы незачтенного аванса.
    
    ТекстЗапроса =
    "ВЫБРАТЬ РАЗЛИЧНЫЕ
    |	НДСАвансыВыданные.Контрагент КАК Поставщик,
    |	НДСАвансыВыданные.ДокументОплаты КАК СчетФактура,
    |	-1 * НДСАвансыВыданные.НДСОстаток КАК СуммаНДСАванса,
    |	НДСАвансыВыданные.ДоговорКонтрагента КАК ДоговорКонтрагента
    |ПОМЕСТИТЬ ОстаткиПоСчету
    |ИЗ
    |	РегистрНакопления.НДСАвансыВыданные.Остатки(&ДатаГраница, Организация = &Организация) КАК НДСАвансыВыданные
    |
    |ИНДЕКСИРОВАТЬ ПО
    |	СчетФактура
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	ОстаткиПоСчету.СчетФактура КАК СчетФактура
    |ПОМЕСТИТЬ СписокСчетовФактур
    |ИЗ
    |	ОстаткиПоСчету КАК ОстаткиПоСчету
    |
    |ИНДЕКСИРОВАТЬ ПО
    |	СчетФактура
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ РАЗЛИЧНЫЕ
    |	ОстаткиПоСчету.СчетФактура КАК СчетФактура,
    |	ЕСТЬNULL(ОстаткиПоСчету.СчетФактура.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) КАК
    |		ДоговорКонтрагента
    |ПОМЕСТИТЬ ДоговорыСчетовФактур
    |ИЗ
    |	ОстаткиПоСчету КАК ОстаткиПоСчету
    |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
    |		ПО ОстаткиПоСчету.СчетФактура = СчетФактураПолученныйДокументыОснования.ДокументОснование
    |ГДЕ
    |	СчетФактураПолученныйДокументыОснования.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСчетФактураПолученный.Аванс)
    |	И НЕ СчетФактураПолученныйДокументыОснования.Ссылка.ПометкаУдаления
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ РАЗЛИЧНЫЕ
    |	ОстаткиПоСчету.СчетФактура,
    |	ЕСТЬNULL(СчетФактураПолученныйДокументыОснования.Ссылка.Договор,
    |		ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка))
    |ИЗ
    |	ОстаткиПоСчету КАК ОстаткиПоСчету
    |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
    |		ПО ОстаткиПоСчету.СчетФактура = СчетФактураПолученныйДокументыОснования.ДокументОснование
    |ГДЕ
    |	СчетФактураПолученныйДокументыОснования.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСчетФактураПолученный.КорректировкаАванса)
    |	И НЕ СчетФактураПолученныйДокументыОснования.Ссылка.ПометкаУдаления
    |
    |ИНДЕКСИРОВАТЬ ПО
    |	СчетФактура,
    |	ДоговорКонтрагента
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	НДСЗаписиКнигиПокупокОбороты.СчетФактура КАК СчетФактура,
    |	НДСЗаписиКнигиПокупокОбороты.Поставщик КАК Поставщик,
    |	НДСЗаписиКнигиПокупокОбороты.ДоговорКонтрагента КАК ДоговорКонтрагента,
    |	НДСЗаписиКнигиПокупокОбороты.СтавкаНДС КАК СтавкаНДС,
    |	НДСЗаписиКнигиПокупокОбороты.ВидЦенности КАК ВидЦенности,
    |	НДСЗаписиКнигиПокупокОбороты.СуммаБезНДСОборот КАК СуммаБезНДС,
    |	НДСЗаписиКнигиПокупокОбороты.НДСОборот КАК НДС,
    |	НДСЗаписиКнигиПокупокОбороты.ИсправленныйСчетФактура КАК ИсправленныйСчетФактура
    |ПОМЕСТИТЬ НДСЗаписиКнигиПокупокОбороты
    |ИЗ
    |	РегистрНакопления.НДСЗаписиКнигиПокупок.Обороты(, &ДатаГраница,, СчетФактура В
    |		(ВЫБРАТЬ
    |			СписокСчетовФактур.СчетФактура
    |		ИЗ
    |			СписокСчетовФактур КАК СписокСчетовФактур)
    |	И ВидЦенности В (ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.АвансыВыданные),
    |		ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.АвансыВыданныеНалоговыйАгент))) КАК НДСЗаписиКнигиПокупокОбороты
    |
    |ИНДЕКСИРОВАТЬ ПО
    |	СчетФактура
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	НДСЗаписиКнигиПокупокОбороты.СчетФактура КАК СчетФактура,
    |	НДСЗаписиКнигиПокупокОбороты.Покупатель КАК Покупатель,
    |	НДСЗаписиКнигиПокупокОбороты.ДоговорКонтрагента КАК ДоговорКонтрагента,
    |	НДСЗаписиКнигиПокупокОбороты.СтавкаНДС КАК СтавкаНДС,
    |	НДСЗаписиКнигиПокупокОбороты.ВидЦенности КАК ВидЦенности,
    |	НДСЗаписиКнигиПокупокОбороты.СуммаБезНДСОборот КАК СуммаБезНДС,
    |	НДСЗаписиКнигиПокупокОбороты.НДСОборот КАК НДС,
    |	НДСЗаписиКнигиПокупокОбороты.ИсправленныйСчетФактура КАК ИсправленныйСчетФактура
    |ПОМЕСТИТЬ НДСЗаписиКнигиПродажОбороты
    |ИЗ
    |	РегистрНакопления.НДСЗаписиКнигиПродаж.Обороты(, &ДатаГраница,, СчетФактура В
    |		(ВЫБРАТЬ
    |			СписокСчетовФактур.СчетФактура
    |		ИЗ
    |			СписокСчетовФактур КАК СписокСчетовФактур)
    |	И ВидЦенности В (ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.АвансыВыданные),
    |		ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.АвансыВыданныеНалоговыйАгент))) КАК НДСЗаписиКнигиПокупокОбороты
    |
    |ИНДЕКСИРОВАТЬ ПО
    |	СчетФактура
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	НДСЗаписиКнигиПокупокОбороты.СчетФактура КАК СчетФактура,
    |	НДСЗаписиКнигиПокупокОбороты.Поставщик КАК Поставщик,
    |	НДСЗаписиКнигиПокупокОбороты.ДоговорКонтрагента КАК ДоговорКонтрагента,
    |	НДСЗаписиКнигиПокупокОбороты.СтавкаНДС КАК СтавкаНДС,
    |	НДСЗаписиКнигиПокупокОбороты.ВидЦенности КАК ВидЦенности,
    |	НДСЗаписиКнигиПокупокОбороты.СуммаБезНДС - ЕСТЬNULL(НДСЗаписиКнигиПродажОбороты.СуммаБезНДС, 0) КАК СуммаБезНДС,
    |	НДСЗаписиКнигиПокупокОбороты.НДС - ЕСТЬNULL(НДСЗаписиКнигиПродажОбороты.НДС, 0) КАК НДС,
    |	НДСЗаписиКнигиПокупокОбороты.ИсправленныйСчетФактура КАК ИсправленныйСчетФактура
    |ИЗ
    |	НДСЗаписиКнигиПокупокОбороты КАК НДСЗаписиКнигиПокупокОбороты
    |		ЛЕВОЕ СОЕДИНЕНИЕ НДСЗаписиКнигиПродажОбороты КАК НДСЗаписиКнигиПродажОбороты
    |		ПО НДСЗаписиКнигиПокупокОбороты.СчетФактура = НДСЗаписиКнигиПродажОбороты.СчетФактура
    |		И НДСЗаписиКнигиПокупокОбороты.ВидЦенности = НДСЗаписиКнигиПродажОбороты.ВидЦенности
    |		И НДСЗаписиКнигиПокупокОбороты.СтавкаНДС = НДСЗаписиКнигиПродажОбороты.СтавкаНДС
    |		И НДСЗаписиКнигиПокупокОбороты.ДоговорКонтрагента = НДСЗаписиКнигиПродажОбороты.ДоговорКонтрагента
    |		И НДСЗаписиКнигиПокупокОбороты.ИсправленныйСчетФактура = НДСЗаписиКнигиПродажОбороты.ИсправленныйСчетФактура
    |		И НДСЗаписиКнигиПокупокОбороты.Поставщик = НДСЗаписиКнигиПродажОбороты.Покупатель
    |ГДЕ
    |	НДСЗаписиКнигиПокупокОбороты.НДС - ЕСТЬNULL(НДСЗаписиКнигиПродажОбороты.НДС, 0) > 0
    |
    |УПОРЯДОЧИТЬ ПО
    |	СчетФактура,
    |	Поставщик
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	ОстаткиПоСчету.СчетФактура КАК СчетФактура,
    |	ОстаткиПоСчету.Поставщик КАК Поставщик,
    |	ОстаткиПоСчету.СуммаНДСАванса КАК СуммаНДСАванса
    |ИЗ
    |	ОстаткиПоСчету КАК ОстаткиПоСчету
    |
    |УПОРЯДОЧИТЬ ПО
    |	СчетФактура,
    |	Поставщик
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	РасчетыСПоставщиками.Контрагент КАК Поставщик,
    |	ЕСТЬNULL(ДоговорыСчетовФактур.ДоговорКонтрагента, РасчетыСПоставщиками.Договор) КАК ДоговорКонтрагента,
    |	РасчетыСПоставщиками.Документ КАК СчетФактура,
    |	СУММА(РасчетыСПоставщиками.СуммаОстаток) * -1 КАК Сумма
    |ИЗ
    |	РегистрНакопления.РасчетыСПоставщиками.Остатки(&ДатаГраница, ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
    |	И Организация = &Организация
    |	И Документ В
    |		(ВЫБРАТЬ
    |			СписокСчетовФактур.СчетФактура
    |		ИЗ
    |			СписокСчетовФактур КАК СписокСчетовФактур)) КАК РасчетыСПоставщиками
    |		ЛЕВОЕ СОЕДИНЕНИЕ ДоговорыСчетовФактур КАК ДоговорыСчетовФактур
    |		ПО РасчетыСПоставщиками.Документ = ДоговорыСчетовФактур.СчетФактура
    |		И ВЫБОР
    |			КОГДА ДоговорыСчетовФактур.ДоговорКонтрагента <> ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
    |				ТОГДА РасчетыСПоставщиками.Договор = ДоговорыСчетовФактур.ДоговорКонтрагента
    |			ИНАЧЕ ИСТИНА
    |		КОНЕЦ
    |ГДЕ
    |	РасчетыСПоставщиками.СуммаОстаток * -1 > 0
    |СГРУППИРОВАТЬ ПО
    |	РасчетыСПоставщиками.Контрагент,
    |	РасчетыСПоставщиками.Документ,
    |	ЕСТЬNULL(ДоговорыСчетовФактур.ДоговорКонтрагента, РасчетыСПоставщиками.Договор)
    |
    |УПОРЯДОЧИТЬ ПО
    |	Поставщик,
    |	СчетФактура,
    |	ДоговорКонтрагента";
    
    Возврат ТекстЗапроса;

КонецФункции

Функция СтруктураОтбораСтрок()
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Поставщик");
	СтруктураОтбора.Вставить("ДоговорКонтрагента");
	СтруктураОтбора.Вставить("СчетФактура");
	Возврат СтруктураОтбора;

КонецФункции

#КонецОбласти

#Область ФормированиеДвижений

// Процедура выполняет восстановление НДС по выданным авансам, вызывается Из документа ФормированиеЗаписейКнигиПродаж
//
Процедура СформироватьДвиженияВосстановлениеНДСПоВыданнымАвансам(ТаблицаРеквизиты, ТаблицаАвансов, Движения, Отказ) Экспорт

    Реквизиты = ТаблицаРеквизиты[0];

	ПлательщикНДСНаУСНСВычетами = УчетнаяПолитика.ПлательщикНДСНаУСНСВычетами(Реквизиты.Организация, Реквизиты.Период);
	ПлательщикНДС               = УчетнаяПолитика.ПлательщикНДС(Реквизиты.Организация, Реквизиты.Период)
		Или ПлательщикНДСНаУСНСВычетами;

	Если Не ПлательщикНДС Тогда
		Возврат;
	КонецЕсли;

	ТаблицаАвансов.Свернуть(
        "Покупатель,ДоговорКонтрагента,СчетФактура,ДокументОплаты,ИсправленныйСчетФактура,СтавкаНДС,ДатаСобытия,Событие,
		|ВидЦенности,ЗаписьДополнительногоЛиста,КорректируемыйПериод,СторнирующаяЗаписьДопЛиста,ДатаОплаты,КодВидаОперации",
		"НДС,СуммаБезНДС");

	СформироватьДвиженияНДСЗаписиКнигиПродажВосстановлениеНДСВыданныйАванс(Реквизиты, ТаблицаАвансов, Движения, Отказ);
    СформироватьДвиженияНДСАвансыВыданные(Реквизиты, ТаблицаАвансов, Движения, Отказ);
 
КонецПроцедуры

Процедура СформироватьДвиженияНДСЗаписиКнигиПродажВосстановлениеНДСВыданныйАванс(Реквизиты, ТаблицаАвансов, Движения, Отказ)

	Для каждого СтрокаТаблицы Из ТаблицаАвансов Цикл

		НоваяЗапись = Движения.НДСЗаписиКнигиПродаж.Добавить();

		ЗаполнитьЗначенияСвойств(НоваяЗапись, Реквизиты);
		ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаТаблицы);

		Если СтрокаТаблицы.ВидЦенности = Перечисления.ВидыЦенностей.АвансыВыданныеНалоговыйАгент Тогда
			НоваяЗапись.КодВидаОперации = "43";
		Иначе
			НоваяЗапись.КодВидаОперации = СтрокаТаблицы.КодВидаОперации;
		КонецЕсли;
		
	КонецЦикла;

	Движения.НДСЗаписиКнигиПродаж.Записывать = Истина;

КонецПроцедуры

Процедура СформироватьДвиженияНДСАвансыВыданные(Реквизиты, ТаблицаАвансов, Движения, Отказ)

	Если ТаблицаАвансов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ТаблицаДвиженийНДСАвансыВыданные = Движения.НДСАвансыВыданные.ВыгрузитьКолонки();

	Для Каждого СтрокаТаблицы Из ТаблицаАвансов Цикл

		Если ТипЗнч(СтрокаТаблицы.СчетФактура) = Тип("ДокументСсылка.СчетФактураПолученный") Тогда
			Продолжить;
		КонецЕсли;

		НоваяЗапись = ТаблицаДвиженийНДСАвансыВыданные.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Реквизиты);
		ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаТаблицы);

		ДоговорКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТаблицы.СчетФактура,
			"ДокументОснование.Договор");

		НоваяЗапись.ВидДвижения = ВидДвиженияНакопления.Приход;
		НоваяЗапись.Контрагент = СтрокаТаблицы.Покупатель;
		НоваяЗапись.ДокументОплаты = СтрокаТаблицы.СчетФактура;
		НоваяЗапись.ДоговорКонтрагента = ДоговорКонтрагента;
		НоваяЗапись.НДСУпр = СтрокаТаблицы.НДС;
//		ДокументЗачетаАванса = 
		
		Если СтрокаТаблицы.ВидЦенности = Перечисления.ВидыЦенностей.Возврат Тогда
			НоваяЗапись.Событие = Перечисления.СобытияНДСАвансы.ВосстановлениеПриВозвратеАванса;
		Иначе
			НоваяЗапись.Событие = Перечисления.СобытияНДСАвансы.ВосстановлениеПриЗачетеАванса;
		КонецЕсли;
		НоваяЗапись.СтавкаНДС = Справочники.СтавкиНДС.СтавкаНДСПоПеречислениюСтавкиНДС(СтрокаТаблицы.СтавкаНДС);
		НоваяЗапись.РегламентнаяОперация = Ложь;
		НоваяЗапись.Сторно = Ложь;
		НоваяЗапись.Активность = Истина;
	КонецЦикла;

	ТаблицаДвиженийНДСАвансыВыданные.Свернуть(
		"Период,Активность,Организация,ДокументОплаты,Контрагент,ДоговорКонтрагента,СтавкаНДС,НаправлениеДеятельности,ИсправленныйСчетФактура, ВидДвижения, Событие, ДатаСобытия, ДокументЗачетаАванса",
		"СуммаБезНДС,НДС,НДСУпр");

	Движения.НДСАвансыВыданные.Загрузить(ТаблицаДвиженийНДСАвансыВыданные);

	Движения.НДСАвансыВыданные.Записывать = Истина;

КонецПроцедуры

#КонецОбласти

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
    
    
КонецПроцедуры

#КонецОбласти

#КонецЕсли
